2.2.013/src/Catalogs/МК_НастройкаВыгрузкиПлановыхНачислений/МК_НастройкаВыгрузкиПлановыхНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_НастройкаВыгрузкиПлановыхНачислений</name>
  <attributes>
    <name>Выгружать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитМК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления1С</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоВыгружать</name>
    <type>
      <types>EnumRef.МК_ВидыВыгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Enums/МК_ВидыВыгрузки/МК_ВидыВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_ВидыВыгрузки</name>
  <enumValues>
    <name>Размер</name>
  </enumValues>
  <enumValues>
    <name>ПоказательРасчетаЗарплаты</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_НастройкаВыгрузкиПлановыхНачислений/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ЧтоВыгружать=Перечисления.МК_ВидыВыгрузки.ПустаяСсылка() ИЛИ Объект.ЧтоВыгружать=Перечисления.МК_ВидыВыгрузки.Размер Тогда
		Элементы.Показатель.ТолькоПросмотр = Истина;     
	Иначе	                                             
		Элементы.Показатель.ТолькоПросмотр = Ложь;     
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЧтоВыгружатьПриИзменении(Элемент)
	Если Объект.ЧтоВыгружать = ПредопределенноеЗначение("Перечисление.МК_ВидыВыгрузки.ПоказательРасчетаЗарплаты") Тогда
		Элементы.Показатель.ТолькоПросмотр = Ложь;		
	Иначе                                         
		Элементы.Показатель.ТолькоПросмотр = Истина; 
		Объект.Показатель = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполненностиПоказателя(Отказ)
	Если Объект.ЧтоВыгружать =  Перечисления.МК_ВидыВыгрузки.ПоказательРасчетаЗарплаты Тогда
		Если Не ЗначениеЗаполнено(Объект.Показатель) Тогда
        	Отказ = Истина;
        	Сообщить("Заполните значение показателя!");
		КонецЕсли;	
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПроверкаЗаполненностиПоказателя(Отказ);
КонецПроцедуры
